scenarios/bng-perf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="bng perf">
      <stringProp name="TestPlan.comments">The BNG performance suite as ONE plan, so a run produces ONE JMeter report.

Two thread groups run against two services in a single execution:

  1. "Home page" — GET / on the public FRONTEND (no auth). A smoke check that the
     home page loads and returns 200 within maxResponseMs.

  2. "Project list endpoints" — the authenticated BACKEND list endpoints, covering
     BMD-933 "Only load the project details the list page actually needs". Drives
     GET /users/{userId}/projects and GET /projects under concurrency and asserts:
       AC1 Size Assertion   — list payload under listSizeLimitBytes (flat vs baseline size)
       AC2 Response Assertion — payload excludes the document-body keys habitats/postIntervention
       AC3 Response Assertion — payload includes the projected has_baseline flag
       AC4 Response Assertion — both endpoints accept limit/offset and return 200
       Duration Assertion   — guards the multi-second stall a multi-MB JSON.stringify causes
     This group is RED by design against an unfixed backend and PASSES once the
     projection + limit/offset fix lands. It REQUIRES a seeded environment (a project
     with a baseline visible to the token's user) — entrypoint.sh seeds via the API.

The auth header is scoped to the backend group only, so the frontend request is
sent unauthenticated. Each group targets its own host, so one run hits both.

Runtime properties (all overridable with -J..., wired from env vars in entrypoint.sh):
  frontendDomain / backendDomain   per-service hosts (default *.${env}.cdp-int.defra.cloud)
  port / protocol / env            shared target port/scheme/environment
  bearerToken                      Bearer token for the backend group. No default —
                                   entrypoint.sh mints a real cdp-defra-id-stub token.
  userId                           path segment for /users/{userId}/projects (the handler
                                   trusts the token sub, not this value). Default: me
  maxResponseMs                    home-page per-request time budget (default 2000)
  listSizeLimitBytes               max backend list response size (default 262144 = 256 KB)
  listMaxLatencyMs                 max backend list response time (default 2000)
  limit / offset                   pagination params exercised on both endpoints (default 50 / 0)
  homeThreads / homeRampSeconds / homeLoops   home-page load profile (default 1 / 1 / 5)
  listThreads / listRampSeconds / listLoops   backend load profile (default 10 / 10 / 20)</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="maxResponseMs" elementType="Argument">
            <stringProp name="Argument.name">maxResponseMs</stringProp>
            <stringProp name="Argument.value">${__P(maxResponseMs,2000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="bearerToken" elementType="Argument">
            <stringProp name="Argument.name">bearerToken</stringProp>
            <stringProp name="Argument.value">${__P(bearerToken,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="userId" elementType="Argument">
            <stringProp name="Argument.name">userId</stringProp>
            <stringProp name="Argument.value">${__P(userId,me)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="listSizeLimitBytes" elementType="Argument">
            <stringProp name="Argument.name">listSizeLimitBytes</stringProp>
            <stringProp name="Argument.value">${__P(listSizeLimitBytes,262144)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="listMaxLatencyMs" elementType="Argument">
            <stringProp name="Argument.name">listMaxLatencyMs</stringProp>
            <stringProp name="Argument.value">${__P(listMaxLatencyMs,2000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="pageLimit" elementType="Argument">
            <stringProp name="Argument.name">pageLimit</stringProp>
            <stringProp name="Argument.value">${__P(limit,50)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="pageOffset" elementType="Argument">
            <stringProp name="Argument.name">pageOffset</stringProp>
            <stringProp name="Argument.value">${__P(offset,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Home page">
        <stringProp name="ThreadGroup.num_threads">${__P(homeThreads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(homeRampSeconds,1)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(homeLoops,5)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET / (home page)">
          <stringProp name="HTTPSampler.domain">${__P(frontendDomain,bng-metric-frontend.${__P(env)}.cdp-int.defra.cloud)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(protocol,https)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(frontendPort,${__P(port,443)})}</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Loads within maxResponseMs">
            <stringProp name="DurationAssertion.duration">${maxResponseMs}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Project list endpoints">
        <stringProp name="ThreadGroup.num_threads">${__P(listThreads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(listRampSeconds,10)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(listLoops,20)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <stringProp name="HTTPSampler.domain">${__P(backendDomain,bng-metric-backend.${__P(env)}.cdp-int.defra.cloud)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(protocol,https)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(backendPort,${__P(port,443)})}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth + Accept headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${bearerToken}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /users/{userId}/projects">
          <stringProp name="HTTPSampler.path">/users/${userId}/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Excludes document body (BMD-933 AC2)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-802113328">habitats</stringProp>
              <stringProp name="583743425">postIntervention</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Includes has_baseline (BMD-933 AC3)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1006645088">has_baseline</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response under listMaxLatencyMs">
            <stringProp name="DurationAssertion.duration">${listMaxLatencyMs}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /users/{userId}/projects?limit&amp;offset">
          <stringProp name="HTTPSampler.path">/users/${userId}/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="limit" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">limit</stringProp>
                <stringProp name="Argument.value">${pageLimit}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="offset" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">offset</stringProp>
                <stringProp name="Argument.value">${pageOffset}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Accepts limit/offset — Status 200 (BMD-933 AC4)">
            <stringProp name="TestPlan.comments">Pre-fix the users endpoint Joi-validates query to sort/order only and 400s on unknown params, so this assertion is expected to fail until limit/offset are supported.</stringProp>
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /projects">
          <stringProp name="HTTPSampler.path">/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Excludes document body (BMD-933 AC2)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-802113328">habitats</stringProp>
              <stringProp name="583743425">postIntervention</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Includes has_baseline (BMD-933 AC3)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1006645088">has_baseline</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response under listMaxLatencyMs">
            <stringProp name="DurationAssertion.duration">${listMaxLatencyMs}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /projects?limit&amp;offset">
          <stringProp name="HTTPSampler.path">/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="limit" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">limit</stringProp>
                <stringProp name="Argument.value">${pageLimit}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="offset" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">offset</stringProp>
                <stringProp name="Argument.value">${pageOffset}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Accepts limit/offset — Status 200 (BMD-933 AC4)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">report.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>